Revit 2027 API
ElementDesignOptionFilter.DesignOptionId Property
 The design option id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId DesignOptionId { get; }
Public ReadOnly Property DesignOptionId As ElementId
	Get
public:
property ElementId^ DesignOptionId {
	ElementId^ get ();
}
member DesignOptionId : ElementId with get
Property Value
ElementId
See Also
Reference
ElementDesignOptionFilter Class
Autodesk.Revit.DB Namespace